Revit 2026 API

# ExternalApplicationArrayIterator Properties

---

The ExternalApplicationArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |

#### Reference

ExternalApplicationArrayIterator Class

Autodesk.Revit.UI Namespace